-- -------------------------------------------------------------
-- TablePlus 3.11.0(352)
--
-- https://tableplus.com/
--
-- Database: postgres
-- Generation Time: 2020-12-18 09:38:15.3200
-- -------------------------------------------------------------


DROP TABLE IF EXISTS "public"."reports";
-- This script only contains the table creation statements and does not fully represent the table in the database. It's still missing: indices, triggers. Do not use it as a backup.

-- Sequence and defined type
CREATE SEQUENCE IF NOT EXISTS reports_reports_id_seq;

-- Table Definition
CREATE TABLE "public"."reports" (
    "reports_id" int4 NOT NULL DEFAULT nextval('reports_reports_id_seq'::regclass),
    "reports_name" varchar(50) NOT NULL,
    "reports_type" int4 NOT NULL,
    "reports_content1" text NOT NULL,
    "reports_content2" text,
    "reports_content3" text,
    "reports_content4" text,
    "reports_eyecatch" varchar(200),
    "reports_photo2" varchar(200),
    "reports_photo3" varchar(200),
    "reports_heading1" varchar(50),
    "reports_heading2" varchar(50),
    "reports_heading3" varchar(50),
    "products_id1" int4,
    "products_id2" int4,
    "products_id3" int4,
    "products_id4" int4,
    "products_id5" int4,
    "makers_id" int4,
    "register_time" timestamp NOT NULL,
    "register_person" varchar(20) NOT NULL,
    "update_time" timestamp,
    "update_person" varchar(20),
    "delete_time" timestamp,
    "delete_person" varchar(20),
    "reports_show" bool NOT NULL,
    PRIMARY KEY ("reports_id")
);

INSERT INTO "public"."reports" ("reports_id", "reports_name", "reports_type", "reports_content1", "reports_content2", "reports_content3", "reports_content4", "reports_eyecatch", "reports_photo2", "reports_photo3", "reports_heading1", "reports_heading2", "reports_heading3", "products_id1", "products_id2", "products_id3", "products_id4", "products_id5", "makers_id", "register_time", "register_person", "update_time", "update_person", "delete_time", "delete_person", "reports_show") VALUES
('1', '「あわみやげ」オープンしました。', '3', '徳島県のお土産紹介サイト「あわみやげ」オープンしました。徳島のお土産って何があるの？どんなお土産が人気なの？そんな時に覗いてみてください、徳島の魅力が詰まったお土産がたくさんあります！', '', '', '', './img/img_reports/1/1-1.jpg', '', '', '', '', '', NULL, NULL, NULL, NULL, NULL, NULL, '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('2', 'インスタ映え！フレッシュな果実を使ったおしゃれなジャムを食べ比べしてみた', '2', '手土産って迷いませんか？お菓子だと好みが別れるし、沢山ありすぎて悩んでしまう！そんな時に無添加のジャムはどうでしょう？今回ご紹介するのは、yoko''s jam teaさんの無添加の手作りジャムです。赤、黄色、緑…などインスタ映えしそうなキレイな色のジャムをご紹介します！', 'yoko''s jam teaさんのジャムは無農薬・低農薬にこだわり出来る限り無農薬・低農薬の素材を選んで作られているそうです。。香料・着色料・保存料等の添加物は一切使っておらず、果実そのままのおいしさを味わえる一品となっています。コロンとした可愛らしいガラス瓶に入ったカラフルでおしゃれなジャムは手土産にぴったりです。', '沢山あるフレーバーの中から、すだち、完熟しらぬい、リンゴラズベリーをクラッカーに乗せて試食してみました。まず瓶をあけてみると瓶の上の方までみっちりとジャムが入っていました。すだちは口に入れた瞬間すだちのさわやかな香りが広がり程よい甘さで、サイダーなどで割って飲み物にしても合いそうだなと思いました。完熟しらぬいはほかの2つと比べてシロップのようにさらさらしていていました。甘味があっさりしていて、ほのかなみかんの苦みがアクセントになっています。大きな果肉が入っていて、素材そのものの良さを感じられました。リンゴラズベリーはリンゴの優しい甘みがラズベリーの甘味を引き立てて、こちらもしらぬい同様大きな果肉がごろっと入っているのもうれしいです。3つの中で一番甘味が強く、甘いのが好きな方におすすめです。', '今回試食した3つの味はどれも果実の自然な味を感じることができてとてもおいしかったです。沢山フレーバーがあるので、他のものも食べたくなってしまいました。添加物が一切使われていないので小さなお子様にも安心ですし、カラフルな見た目は食卓を華やかにしてくれそうです。女性には特に喜ばれること間違いなしだと思います！ぜひチェックしてみてください。', './img/img_reports/2/2-1.jpg', './img/img_reports/2/2-2.jpg', './img/img_reports/2/2-3.jpg', 'ジャムを買ってみた', 'ジャムを食べ比べみた', 'まとめ', '73', NULL, NULL, NULL, NULL, '37', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 'f'),
('3', '徳島のご当地ドリンク「ザすだち」を飲んでみた', '1', '紙製飲料缶と普通の缶のパッケージがありますが今回は缶の方を購入してみました。まず見た目ですが、ザすだちとわかりやすく書かれ、すだちの果実と花が描かれたパッケージは昔から変わらず一目ですだちの飲み物！とわかるので徳島のおみやげとしておすすめですし、徳島県民にとっては気心の知れた人への贈答品としてもおすすめです。果汁は3パーセント使用されています。', '紙製飲料缶と普通の缶のパッケージがありますが今回は缶の方を購入してみました。まず見た目ですが、ザすだちとわかりやすく書かれ、すだちの果実と花が描かれたパッケージは昔から変わらず一目ですだちの飲み物！とわかるので徳島のおみやげとしておすすめですし、徳島県民にとっては気心の知れた人への贈答品としてもおすすめです。果汁は3パーセント使用されています。', 'すだちというと酸味が強いのかと思いきや、甘さもすだちの風味もほどほどでとてもおいしく飲みやすいです。後味がすっきりさわやかで、夏やスポーツをしたあとにも気分がリフレッシュできそうなやさしい味がしました。何本でも飲んでしまえそうなスッキリ感です。', '1本100円とお手頃なお値段ですし、お友達に渡すおみやげに1本プラスして渡したりするのもいいかもしれませんね。徳島のご当地ドリンクをぜひお試しください！', './img/img_reports/3/3-1.jpg', './img/img_reports/3/3-2.jpg', './img/img_reports/3/3-3.jpg', '「ザすだち」を買ってみた', '「ザすだち」を飲んでみた', 'まとめ', '100', NULL, NULL, NULL, NULL, '45', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('4', '鳴門金時を使ったお菓子「クリーミースイートポテト」を試食してみた', '1', '徳島には特産品の一つである鳴門金時を使用したお菓子が沢山あります。その中でもおみやげを買う時、ぜひお試しいただきたいスタッフ一推しのお菓子をご紹介します！今回ご紹介するのは、なかのファームさんの鳴門金時を使ったお菓子クリーミースイートポテトです。なかのファームさんの看板商品です。おどろくほど、しっとりクリーミィーな食感のスイートポテト。 主原料である、なると金時本来の美味しさを最大限に引き出すため、甘さは控えめ。このカラダにもやさしいナチュラルスイーツは、冷やしても、温めても美味しく召し上がっていただけます。とのこと。徳島県の推奨する「阿波の逸品」にも選ばれているそうです。', 'できたてそのままのおいしさを瞬間冷凍された生スイーツで、なんとなると金時を原料のうち70%と贅沢に使用されています。購入時は冷凍されていますので、食べたいときに食べたいだけ解凍して食べるようです。冷凍庫では約3か月間保存できますが、解凍後は賞味期限に関わらず当日中にお召し上がりくださいとありますので県外の方がおみやげとして購入される場合は、購入店で郵送してもらったり、ＷＥＢショップで購入されたほうがよいかもしれません。', '温めてもおいしいそうですが、今回は冷たいものを試食してみました。まずおどろいたのがその柔らかさです。木のフォークで食べましたが、すくいながら食べる感覚です。解凍して食べたので触感はねっとりしていました。味はおいも本来の優しい甘みが感じられ、名前通り本当にクリーミーでおいしいです。解凍具合でも触感が変わりそうなので、シャリシャリだったり、ねっとりだったりとお好みの触感を探すのも楽しそうです。', '試食スタッフのおみやげをいつもあまり食べないおじいちゃんが思わずおかわりしたというエピソードがあるくらい、いくらでも食べられそうなおいしいお菓子でした。お子様から年配の方まで幅広い年代の方におすすめで、リピート間違いなしのお菓子です！', './img/img_reports/4/4-1.jpg', './img/img_reports/4/4-2.jpg', './img/img_reports/4/4-3.jpg', '「クリーミースイートポテト」を買ってみた', '「クリーミースイートポテト」を食べてみた', 'まとめ', '31', NULL, NULL, NULL, NULL, '10', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('5', '「NARUTO DAI2 BOUTON （鳴門第2ボタン）」を試食してみた', '1', 'NARUTO DAI2 BOUTON （鳴門第2ボタン）と聞いたらどんなお菓子を想像しますか？とてもユニークなネーミングですよね！今回ご紹介するNARUTO DAI2 BOUTON （鳴門第2ボタン）は西麻布の徳島フレンチ・レストラン フレンチモンスターさんが2020年1月、鳴門市・よもみ展望台隣に、お菓子工房「瀬戸内フードアート」をオープンすることを記念して作られた新作のお菓子です。本家松浦酒造とのコラボレーションスイーツで徳島の酒蔵・本家松浦酒造純米大吟醸の酒粕を使って作られたサブレです。', 'まず目を引くのはボタンがあしらわれたおしゃれなパッケージです。こちらの箱はフランスのアンティークのボタンの箱をモチーフにしているそうです。箱についているボタンは、アンティークのため、形も色も大きさも様々だそう。お菓子の形はこれまたボタンのようにまんまるのコロンとしたつまみやすそうな形です。', 'ほんのり日本酒の香りがして、バターの風味がしっかりと感じられます！酒粕はそれほど主張が強いわけではなく、クセがないので上品な一品です。甘さ控えめで、大人な味でした。', 'おしゃれなパッケージと、甘すぎない味なので男性にも送りやすいお菓子ではないでしょうか。日本酒好きな方にもおすすめです！', './img/img_reports/5/5-1.jpg', './img/img_reports/5/5-2.jpg', './img/img_reports/5/5-3.jpg', '「NARUTO DAI2 BOUTON （鳴門第2ボタン）」を買ってみた', '「NARUTO DAI2 BOUTON （鳴門第2ボタン）」を食べてみた', 'まとめ', '34', NULL, NULL, NULL, NULL, '11', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('6', '後味ピリッと大人な味「みまからあられ」を試食してみた', '1', 'おみやげを買う時ついつい甘いものだけ選んでいませんか？甘いお菓子も魅力的ですが、ちょっと辛い大人な味のあられがあります！今回ご紹介するのは有限会社 日乃出本店さんのみまからあられです。みまからあられは徳島県美馬市の特産品「みまから唐辛子」を使ったピリ辛なあられです。糖度はメロン並み、辛さはハバネロ級という非常に珍しい特徴を持つみまから唐辛子は昔から美馬地方で作られていました。厳しい規格基準をクリアできるのはこの地の気候風土と地元の農家さんの熱意が絶対条件であり、誰でも作れる唐辛子ではなく、美馬でしか作ることのできない唐辛子だそうです。', 'パッケージは真っ赤っかで、旨辛という文字を囲む炎のデザイン、唐辛子の絵が辛さを演出しています。袋を開けてみると醤油の甘辛い香りが食欲をそそります。', '辛さがガツンとくるのか！と思いきや、はじめは「ん？」という感じでした。思ったほど辛くないというのが第一印象です。でも醤油味のあとに後味に辛さがじんわりとやってきました。辛さと甘さのバランスがGoodです。お酒のおつまみとしても合いそうだなと思いました。', '程よい辛さのみまからあられはお酒好きな方や、辛いのが好きな方にぴったりなおみやげだと思います。2020年に発売されたばかりの新しいお菓子なのでチェックしてみてください！', './img/img_reports/6/6-1.jpg', './img/img_reports/6/6-2.jpg', './img/img_reports/6/6-3.jpg', '「みまからあられ」を買ってみた', '「みまからあられ」を食べてみた', 'まとめ', '6', NULL, NULL, NULL, NULL, '2', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('7', '徳島県産木頭ゆずを使った「柚子茶」を飲んでみた', '1', '寒くなってくると、あったか～い飲み物をのんでホッとしたくなりますよね。すだちが有名な徳島ですが、実は現在木頭ゆずの出荷量は県内では1位で、全国的にも徳島県の柚子出荷量は11、2位となっており、ゆずも特産品の一つなのです！徳島県の那賀町にある木頭地区は、標高高く、昼夜の温度差が激しいので、格別香り高いゆずが実ります。今回は株式会社柚りっ子さんの徳島県産木頭ゆずを使った柚子茶をご紹介します。香り高い、徳島県産・木頭ゆずのおいしさをまるごと（種以外全部）閉じ込めた柚子茶です。砂糖は北海道産甜菜糖の最高純度ロック氷糖を使用されており、シンプル素材の無添加柚子茶は、ゆずの風味を満喫できる逸品となっています。', 'ジャムのガラス容器に入っており、パッケージのシール、容器から見える共にゆずの黄色が目を引きます。ゆずの皮がたっぷりと入っているのが入っているのが見えるので、飲むのが楽しみになります。', 'お湯で割って飲んでみました。お好みで濃さを調節できるのがいいところですが、私は濃いめで飲んだ方が好みでした！鼻に抜けるゆずのさわやかな香りと、濃厚な甘味がとても美味しいです。', 'お料理の時にソースにいれて隠し味にしたり、飲む以外にもアレンジできそうです。冬はホットで飲んでほっとして、夏はソーダ割ですっきりと！ぜひお試しください。', './img/img_reports/7/7-1.jpg', './img/img_reports/7/7-2.jpg', './img/img_reports/7/7-3.jpg', '「柚子茶」を買ってみた', '「柚子茶」を飲んでみた', 'まとめ', '45', NULL, NULL, NULL, NULL, '18', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('8', '徳島銘菓の「小男鹿（さおしか）」を試食してみた', '1', '全国の地域それぞれに存在するご当地銘菓。徳島にも昔から親しまれている銘菓があります。それが百三十年の伝統を持つ老舗、小男鹿本舗 冨士屋さんの「小男鹿（さおしか）」です。2011年7月にテレビ番組「秘密のケンミンSHOW」でも紹介されたことがあります。古くから人々に愛され歌にも詠まれた牡の鹿をモチーフとしている蒸し菓子です。高級なイメージがあり贈答用として使われことが多く、山の芋、阿波特産和三盆糖、厳選された小豆と粳米、これら全ての持ち味を、それぞれに活かし、伝統の手法で練り上げられて作られています。', 'まず見た目ですが、鹿子斑の肌模様が可愛らしく切ってお皿に並べるだけで、上品さがただよってきます。ところどころに散りばめられた小豆がより一層可愛い鹿を思い起こさせます。見た目はふわふわとしていそうなカステラのようです。', 'その見た目からふわっとした食感を想像していたのですが、いい意味で裏切られました。実際には、しっとりもちもちとしていて本当に上品な口当たりです。甘さも甘すぎず、程よい甘さで、あったかい緑茶と一緒に食べるとホッとする味でした。', '少し高級なので、徳島県民は貰うととてもうれしいおみやげの一つではないでしょうか。また徳島県の代表的なおみやげなので県外の方にも喜ばれると思います。自分のご褒美としてもぜひお試しください！', './img/img_reports/8/8-1.jpg', './img/img_reports/8/8-2.jpg', './img/img_reports/8/8-3.jpg', '「小男鹿（さおしか）」を買ってみた', '「小男鹿（さおしか）」を食べてみた', 'まとめ', '17', NULL, NULL, NULL, NULL, '8', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('9', 'パッケージが可愛い鳴門のお菓子「なるとのしっぽ」を試食してみた', '1', 'みなさんがおみやげを選ぶとき何を基準にして選んでいますか？値段？入り数？それとも見た目でしょうか？せっかく贈るものだから渡したときに相手の喜ぶ顔が見たいですよね。そんなあなたにおすすめしたいおみやげがあります！今回ご紹介するのは（有）あずまやさんの「なるとのしっぽ」です。柴犬のおしりとしっぽのイラストのデザインが可愛いパッケージのおみやげです。中には鳴門金時や紫芋、紅はるかといったさつま芋を使って作られたきんつばが入っていいます。', 'まずめ目に入るのは、しばいぬの「なると」のイラストです。鳴門の渦潮を彷彿とさせるぐるぐるまきのしっぽとおしりがかわいいです。箱を開けてみると、紫芋と鳴門金時が練りあわされたものと、紅はるかのきんつばが2個ずつ、計4個入っています。もちろん原材料のおいもは徳島県産です。紫色と黄色のコントラストが食欲をそそります。', '紫いものきんつばは甘味が強くホクホクとしたおいも特有の食感を感じました。ハチミツや黒糖に似た強い甘みがあります。紅はるかのきんつばは抹茶の香りが際立ち、干しいものような甘味にコクがあるような味がしました。どちらの味もかめばかむほどおいもの風味を強く感じられ、男性でも食べやすい甘さだと思います。', '見た目に可愛い「なるとのしっぽ」。お友達や、お子様に喜ばれるのではないかと思います。見た目だけではなく、中身のきんつばの味もとてもおいしいです。ぜひおみやげを買う時お試しください！', './img/img_reports/9/9-1.jpg', './img/img_reports/9/9-2.jpg', './img/img_reports/9/9-3.jpg', '「なるとのしっぽ」を買ってみた', '「なるとのしっぽ」を食べてみた', 'まとめ', '85', NULL, NULL, NULL, NULL, '39', '2020-12-16 19:40:00', 'Admin', NULL, '', NULL, '', 't'),
('10', '八百秀商事株式会社さんが関東の髙島屋各店にて出張販売', '3', '八百秀さんが2021年1月20日から1月26日まで髙島屋玉川店、1月27日から2月2日まで髙島屋柏店、2月16日から2月23日まで髙島屋横浜店、3月3日から3月8日まで髙島屋新宿店にて出張販売をされます！最寄りの方はぜひお立ち寄りください。', NULL, NULL, NULL, './img/img_reports/10/10-1.jpg', NULL, NULL, NULL, NULL, NULL, '19', NULL, NULL, NULL, NULL, NULL, '2020-12-17 18:00:00', 'Admin', NULL, NULL, NULL, NULL, 't'),
('11', '金ちゃんヌードル現金1万円プレゼントキャンペーン', '3', '2021年3月から2021年7月25日まで金ちゃんヌードル １万円キャンペーンがスタートします。金ちゃんヌードルについている応募券（カップ底 キンツルシール）を５枚１口で集めて御応募いただくと、毎月５００名様（合計２５００名様）に現金１万円が抽選で当たります！金ちゃんヌードル底に貼ってある、キンツルシールを５枚１口で御応募ください♪', NULL, NULL, NULL, './img/img_reports/11/11-1.jpg', NULL, NULL, NULL, NULL, NULL, '20', NULL, NULL, NULL, NULL, NULL, '2020-12-17 18:01:00', 'Admin', NULL, NULL, NULL, NULL, 't'),
('12', '蔵で飲む鳴門鯛を飲むイベント「たちきゅう」のお知らせ', '3', '毎月第3土曜日には、蔵で鳴門鯛を飲むイベント「たちきゅう」を開催しています。毎月、定員を決めて開催しています。ご予約の際は、電話番号におかけください。屋外で開催しますが、天候により室内開催になる場合もございます。', NULL, NULL, NULL, './img/img_reports/12/12-1.jpg', NULL, NULL, NULL, NULL, NULL, '28', NULL, NULL, NULL, NULL, NULL, '2020-12-17 18:10:00', 'Admin', NULL, NULL, NULL, NULL, 't');
